{
    "success": {
        "ECS001": "Xử lý dữ liệu thành công",
        "ECS002": "Lấy dữ liệu thành công",
        "ECS003": "Cập nhật dữ liệu thành công",
        "ECS004": "Thêm mới dữ liệu thành công",
        "ECS005": "Xóa dữ liệu thành công",
        "ECS006": "Kết nối EFY-ID thành công"
    },
    "error": {
        "ECE001": "Phương thức truyền không chính xác",
        "ECE002": "Không tìm thấy trang",
        "ECE003": "Thông tin Header không chính xác",
        "ECE004": "Dữ liệu đầu vào không hợp lệ: $1",
        "ECE005": "Thông tin tài khoản không đúng.Vui lòng kiểm tra lại",
        "ECE006": "Lỗi cập nhật cơ sở dữ liệu",
        "ECE007": "Thông tin xác thực không chính xác",
        "ECE008": "Lỗi kết nối file server",
        "ECE009": "Lỗi xử lý file server",
        "ECE010": "Lỗi cập nhật file server",
        "ECE011": "Đăng nhập sai quá 5 lần. Vui lòng nhập mã Captcha xác thực",
        "ECE012": "Mã Captcha không chính xác",
        "ECE013": "Không tìm thấy loại hợp đồng",
        "ECE014": "Không tìm thấy thông tin gói dịch vụ",
        "ECE015": "Cập nhật dữ liệu không thành công do chứng thư số của người lao động đang ở trạng thái Chờ cấp hoặc Thu hồi.",
        "ECE016": "Xóa dữ liệu không thành công do người lao động đã phát sinh chứng thư số.",
        "ECE017": "Cập nhật dữ liệu không thành công do chứng thư số của người lao động chưa hết hạn sử dụng",
        "ECE018": "Dữ liệu không thể xóa hoặc cập nhật",
		"ECE019": "Đối tượng không tồn tại",
		"ECE020": "Mật khẩu không đúng định dạng (tối thiểu từ $1 ký tự, bao gồm: số, chữ thường và chữ hoa)",
		"ECE021": "Mật khẩu không đúng định dạng (tối thiểu từ $1 ký tự, bao gồm: số, chữ thường và ký tự đặc biệt)",
		"ECE022": "Mật khẩu không đúng định dạng (tối thiểu từ $1 ký tự, bao gồm: số, chữ thường, chữ hoa và ký tự đặc biệt)",
		"ECE023": "Mật khẩu không đúng định dạng (tối thiểu từ $1 ký tự, bao gồm: số, chữ thường)",
		"ECE024": "Danh sách một số người lao động đã phát sinh ràng buộc dữ liệu nên không thể thay thế",
		"ECE025": "Nhật ký không tồn tại",
        "ECE026": "Thay đổi không hợp lệ",
        "ECE027": "Thông tin người dùng không tồn tại",
		"ECE028": "Thao tác không chính xác",
		"ECE029": "Địa chỉ Email không tồn tại. Vui lòng kiểm tra lại",
		"ECE030": "Thông tin đăng nhập (UUID) không chính xác. Vui lòng kiểm tra lại",
        "ECE031": "Mẫu hợp đồng có phát sinh hợp đồng nên không thể xóa",
        "ECE032": "Mẫu hợp đồng đã phát sinh hợp đồng nên không sửa cấu hình số hợp đồng - trường bắt đầu từ số",
        "ECE033": "Mã mẫu hợp đồng đã tồn tại",
        "ECE034": "Tài khoản không có quyền truy cập chức năng này",
        "ECE035": "Tài khoản ký số không chính xác",
        "ECE036": "NLĐ này được thêm trực tiếp từ hệ thống, nên không thể sửa NLĐ này",
        "ECE037": "Thao tác không chính xác, OTP cũ vẫn còn hiệu lực",
        "ECE038": "Sai mã OTP",
        "ECE039": "Kiểu ký không chính xác",
        "ECE040": "OTP đã hết hiệu lực",
        "ECE041": "Chứng thư số đã được cấp, vui lòng kiểm tra email để nhận thông tin.",
        "ECE042": "Không tìm thấy danh sách chứng thư số của người lao động",
        "ECE043": "Chỉ có thể từ chối hợp đồng trong đợt ký có trạng thái chờ ký",
        "ECE044": "Chỉ có thể ký hợp đồng trong đợt ký có trạng thái chờ ký",
        "ECE045": "NLĐ đã phát sinh hợp đồng nên không thể thực hiện thao tác",
        "ECE046": "Đăng nhập sai quá $1 lần. Vui lòng nhập mã Captcha xác thực",
        "ECE047": "Đơn vị đang phát sinh hợp đồng chờ ký nên bạn không thể thay đổi hình thức ký",
        "ECE048": "Lỗi kết nối api Remote signing",
        "ECE049": "Mật khẩu mới và xác nhận mật khẩu mới không khớp",
        "ECE050": "Mẫu chưa được ban hành",
        "ECE051": "Thao tác không chính xác, chỉ được phép hủy hợp đồng có trạng thái chờ ký",
        "ECE052": "Mẫu hợp đồng đã được ban hành nên không thể thực hiện thao tác",
        "ECE054": "Bạn đã nhập sai mật khẩu quá số lần quy định. Sau 3 phút hãy đăng nhập lại",
        "ECE055": "File hợp đồng không tồn tại",
        "ECE056": "Hợp đồng yêu cầu NLĐ cần phải đăng nhập",
        "ECE057": "Tài khoản NLĐ đã ngừng hoạt động",
        "ECE058": "Thứ tự ký không chính xác",
        "ECE059": "Kích thước file quá kích thước cho phép",
        "ECE060": "Thông tin người nhận hợp đồng không chính xác",
        "ECE061": "Chỉ có hợp đồng mới tạo và chờ ký mới có thể thực hiện thao tác",
        "ECE062": "Hợp đồng đã phát sinh ký số nên không thể thực hiện thao tác",
        "ECE063": "Số hợp đồng đã tồn tại",
        "ECE064": "Người nhận đã ký hoặc chưa đến lượt ký",
        "ECE065": "Gói hợp đồng đã sử dụng hết. Vui lòng gia hạn gói để tiếp tục sử dụng dịch vụ",
        "ECE066": "Gói OTP đã sử dụng hết",
        "ECE067": "Tài khoản chưa được cấu hình sử dụng chữ ký số Remote Signing",
        "ECE068": "Ký OTP phải do bên nhận ký trước",
        "ECE069": "Không thể cấp OTP do chưa đến lượt ký",
        "ECE070": "Trạng thái hợp đồng không cho phép thực hiện thao tác này",
        "ECE071": "OTP cũ vẫn còn hiệu lực trong $1 giây",
        "ECE072": "Chưa đăng ký gói hợp đồng",
        "ECE073": "Chỉ có hợp đồng chờ ký, và đã ký mới có thể thực hiện thao tác",
        "ECE074": "Mẫu hợp đồng không tồn tại",
        "ECE075": "Hợp đồng đã tồn tại",
        "ECE076": "Khách hàng không tồn tại",
        "ECE077": "Tên file bị trùng",
        "ECE078": "Lỗi gửi SMS: $1",
        "ECE079": "Tài khoản CKS không trùng khớp với tài khoản CKS trên đã cấu hình",
        "ECE080": "Thông tin khách hàng thực hiện ký số không tồn tại",
        "ECE081": "Mã OTP không chính xác",
        "ECE082": "Không thể thực hiện thao tác, khách hàng đang phát sinh hợp đồng chờ ký",
        "ECE083": "Giấy đăng ký cấp CKS không tồn tại",
        "ECE084": "Hợp đồng đã phát sinh chữ ký, không thể thực hiện thao tác",
        "ECE085": "Tài khoản ký số đơn vị chưa được cập nhật",
        "ECE086": "Tài khoản ký số cá nhân chưa được cập nhật",
        "ECE087": "Hình thức ký không khớp với cấu hình chữ ký số đơn vị, Vui lòng kiểm tra lại cấu hình chữ ký số đơn vị",
        "ECE088": "Hình thức ký không khớp với cấu hình chữ ký số cá nhân, Vui lòng kiểm tra lại cấu hình chữ ký số người sử dụng",
        "ECE089": "Email/SĐT chưa được đăng ký tài khoản EFY-ID",
        "ECE090": "Email/SĐT đã đăng ký EFY-ID và được dùng cho tài khoản khác",
        "ECE091": "Bạn phải đăng nhập bằng EFY-ID",
        "ECE092": "Bạn phải tạo tài khoản EFY-ID để kết nối",
        "ECE093": "Email/SĐT chưa được đăng ký tài khoản EFY.",
        "ECE094": "Lỗi kết nối api tool",
        "ECE095": "Email/SĐT của tài khoản Econtract và EFY-ID không trùng khớp",
        "ECE096": "Thông tin tài khoản EFY-ID đang kết nối không chính xác",
        "ECE097": "Lỗi tham số hệ thống",
        "ECE098": "Bạn không được phép ký hợp đồng này",
        "ECE099": "Phòng ban đang tồn tại NLĐ, không thể thực hiện thao tác",
        "ECE100": "Phòng ban đang có phòng ban cấp bậc con, không thể thực hiện thao tác",
        "ECE101": "Phòng ban không tồn tại",
        "ECE102": "Đơn vị chưa đăng ký kết nối ERP/CMR với eContract",
        "ECE103": "Kiểu kết nối ERP/CRM của đơn vị không chính xác, vui lòng liên hệ với đơn vị gửi hợp đồng",
        "ECE104": "Tài khoản CKS không trùng khớp với tài khoản CKS đã được cấp cho hợp đồng",
        "ECE105": "Hợp đồng không tồn tại",
        "ECE106": "Không thể chỉnh sửa hợp đồng trạng thái: Chờ ký hoặc Đã ký",
        "ECE107": "Chỉ có thể gửi lại hợp đồng khi đến lượt NLĐ ký và NLĐ đang chờ ký",
        "ECE108": "Dịch vụ này đã bị khóa. Vui lòng liên hệ lại bên gửi tài liệu để biết thêm chi tiết.",
        "ECE109": "Tài khoản không thể xóa do đã phát sinh hợp đồng",
        "ECE110": "Gói sms đã sử dụng hết",
        "ECE111": "Tài khoản CKS không trùng khớp với tài khoản CKS đã được cấp cho hợp đồng",
        "ECE112": "Nội dung tin nhắn không được vượt quá 156 ký tự",
        "ECE113": "File đang ký hiện tại chưa là file mới nhất",
        "ECE114": "Sai mã PIN cũ",
        "ECE115": "Nhân viên đã có chữ ký số, không thể sửa thông tin các trường: Tên nhân viên, mã nhân viên, địa chỉ, CMND/CCCD/HC",
        "ECE116": "Hợp đồng đã ký nên không thể thực hiện thao tác",
        "ECE117": "Khách hàng đã ký hợp đồng, hoặc chưa đến lượt ký hợp đồng",
        "ECE118": "Thứ tự ký không chính xác, nên không thể từ chối hợp đồng",
        "ECE119": "Số hợp đồng đã tồn tại",
        "ECE120": "Dung lượng file phải nhỏ hơn 10MB",
        "ECE121": "Dung lượng các files phải nhỏ hơn 10MB",
        "ECE123": "Thứ tự hình thức ký không hợp lệ",
        "ECE124": "Số văn bản đã tồn tại",
        "ECE125": "Chỉ có văn bản mới tạo và chờ ký mới có thể thực hiện thao tác",
        "ECE126": "Văn bản đã phát sinh chữ ký, không thể thực hiện thao tác",
        "ECE127": "Khách hàng đã ký văn bản, hoặc chưa đến lượt ký văn bản",
        "ECE128": "Trạng thái văn bản không cho phép thực hiện thao tác này",
        "ECE129": "Văn bản điện tử không tồn tại",
        "ECE130": "Danh mục không thể sửa do đã phát sinh văn bản chờ ký",
        "ECE131": "File không tồn tại",
        "ECE132": "Người tham gia ký đã ký văn bản, không thể gửi lại thông báo",
        "ECE133": "Chưa đăng ký gói SMS",
        "ECE134": "Gói văn bản đã sử dụng hết. Vui lòng gia hạn gói để tiếp tục sử dụng dịch vụ",
        "ECE135": "Văn bản này không cho phép thực hiện xử lý",
        "ECE136": "Người ký không tồn tại",
        "ECE137": "Không thể xóa người sử dụng $1 do có phát sinh văn bản điện tử",
        "ECE138": "Văn bản đã xử lý, không thể thực hiện ký nháy",
        "ECE139": "Đang ở trạng thái giao việc, nên không thể thực hiện thao tác",
        "ECE140": "Đã thực hiện ký, nên không thể thực hiện thao tác",
        "ECE141": "Người sử dụng đang được giao việc với văn bản này, nên không thể thực hiện thao tác",
        "ECE142": "Văn bản đã được xử lý, nên không thể thực hiện thao tác",
        "ECE143": "Loại văn bản đã được sử dụng, nên không thể thực hiện thao tác",
        "ECE144": "Bạn đã nhập sai mã pin quá nhiều lần. Tài khoản chữ ký số bị khoá 10 phút. Vui lòng thử lại sau.",
        "ECE145": "Hình thức ký của hợp đồng đã được quản trị viên thay đổi, bạn vui lòng chọn lại hình thức ký ở bước 2 (Xác định người ký)",
        "ECE146": "Giờ gửi mail không hợp lệ",
        "ECE147": "Số ngày không hợp lệ",
        "ECE148": "Kích thước file vượt quá 5MB",
        "ECE149": "Tổng dung lượng các file đẩy lên vượt quá 10 MB",

        "ECE150": "Thông tin ký khi tạo hợp đồng của người ký không chính xác",
        "ECE151": "Thông tin tra cứu văn bản không chính xác",
        "ECE152": "Văn bản đã được thu hồi",
        "ECE153": "Văn bản đã được từ chối",
        "ECE154": "Văn bản đã bị hủy",
        "ECE155": "File đính kèm không tồn tại",
        "ECE156": "Hình thức ký của văn bản đã được quản trị viên thay đổi, bạn vui lòng chọn lại hình thức ký ở bước 2 (Xác định người ký)",
        "ECE157": "Đơn vị đang có $1 văn bản ở trạng thái mới tạo, Bạn không thể thay đổi hình thứ ký",
        "ECE158": "Thao tác ký không thành công, vui lòng ký lại",
        "ECE159": "Mã số thuế đã tồn tại",
        "ECE160": "Mã khách hàng đã tồn tại",
        "ECE161": "Không thể thực hiện thao tác, tỉnh/thành thường trú bị rỗng, bạn vui lòng liên hệ với quản trị viên để cập nhật",
        "ECE162": "Hình thức ký của hợp đồng đã được quản trị viên thay đổi, bạn vui lòng chọn lại hình thức ký ở bước 2 (Xác định người lao động)",
        "ECE163": "Không thể thực hiện thao tác, thông tin người lao động chưa được xác thực để cấp chứng thư số",
        "ECE164": "Không tìm thấy biến ảnh chữ ký để xác định vị trí ký của người lao động",
        "ECE165": "Không tìm thấy biến ảnh chữ ký để xác định vị trí ký của người ký",
        "ECE166": "Loại văn bản không tồn tại",
        "ECE167": "Gói hợp đồng còn lại không đủ. Vui lòng gia hạn gói để tiếp tục sử dụng dịch vụ",
        "ECE168": "Văn bản này đã được thu hồi hoặc hủy",


        "ECE200": "Số lượng file đính kèm vượt quá 10 file",
        "ECE201": "Tổng dung lượng file dành cho người lao động $1 vượt quá 10 MB",
        "ECE202": "Quyền ký văn bản của người ký đã được quản trị viên thay đổi, bạn vui lòng chọn lại người ký ở bước 2 (Xác định người ký)",
        "ECE203": "Trạng thái đợt ký không cho phép sửa",
        "ECE204": "Tồn tại người ký chưa xác định",
        "ECE205": "Tổng dung lượng file dành cho văn bản $1 vượt quá 10 MB",
        "ECE206": "Thao tác không chính xác, chỉ được phép hủy văn bản có trạng thái chờ ký",
        "ECE207": "Không có dữ liệu để xuất",
        
        
        "ECE179": "Bạn đang trong thời gian khóa",
        "ECE180": "Mã tra cứu không hợp lệ",
        "ECE181": "Chưa đăng ký CKS transaction",
        "ECE182": "Gói CKS transaction đã sử dụng hết. Vui lòng gia hạn gói để tiếp tục sử dụng dịch vụ",
        "ECE183": "Bạn chưa có CKS trasaction",
        "ECE184": "Không gen được ảnh CKS",
        

        "ECE190": "CMND/CCCD/HC không chính xác",
        "ECE191": "Bạn đã nhập sai quá 10 lần, hệ thống sẽ khóa đăng nhập trong 10 phút",


        "ECW001": "Tài khoản sẽ bị khóa nếu nhập sai quá 5 lần. Số lần đăng nhập còn lại là $1 lần.",
        "ECW002": "Tài khoản không tồn tại trên hệ thống. Vui lòng kiểm tra lại",
        "ECW003": "Đối tượng không tồn tại",
        "ECW004": "Mã nhân viên đã tồn tại",
        "ECW005": "Người lao động không tồn tại",
        "ECW006": "Hợp đồng không tồn tại",
        "ECW007": "Thông tin tài khoản đăng nhập không chính xác",
        "ECW008": "Tài khoản người dùng đang tạm khóa.",
        "ECW009": "Mật khẩu tài khoản đã hết hạn. Vui lòng thay đổi mật khẩu.",
        "ECW010": "Tài khoản không có địa chỉ email, vui lòng liên hệ với quản trị viên để cấp lại mật khẩu",
        "ECW011": "Mã số thuế đã tồn tại",
        "ECW012": "Loại danh mục không tồn tại",
        "ECW013": "Mã danh mục không tồn tại",
        "ECW014": "Mã đối tượng đã tồn tại",
        "ECW015": "Danh mục không cho phép chỉnh sửa",
        "ECW016": "Mật khẩu cũ không chính xác",
        "ECW017": "Người dùng không tồn tại",
        "ECW018": "Tên đăng nhập đã tồn tại",
        "ECW019": "CMND/CCCD/HC đã tồn tại",
        "ECW020": "Email đã tồn tại",
        "ECW021": "Số điện thoại đã tồn tại",
		"ECW022": "Mật khẩu đã từng được sử dụng. Vui lòng thay đổi mật khẩu khác",
        "ECW023": "Mật khẩu tài khoản đã được thay đổi trước đó",
        "ECW024": "Cập nhật thông tin người dùng thất bại",
		"ECW025": "Thao tác sai với vai trò người dùng",
        "ECW026": "Đợt ký hợp đồng không tồn tại",
        "ECW027": "Chỉ có thể xóa đợt ký có trạng thái mới tạo",
        "ECW028": "Không thể xóa đợt ký đã phát sinh hợp đồng đã ký",
        "ECW029": "Không thể sửa tên đợt ký có trạng thái đã ký",
        "ECW030": "Người lao động không tồn tại",
        "ECW031": "Không thể xóa người sử dụng $1 có phát sinh hợp đồng",
        "ECW032": "Bạn không được quyền truy cập chức năng này",
        "ECW033": "Hợp đồng không tồn tại",
        "ECW034": "Mẫu hợp đồng không tồn tại",
        "ECW035": "Số hợp đồng đã tồn tại",
        "ECW036": "Lỗi kết nối api",
        "ECW037": "Không tìm thấy người ký",
        "ECW038": "Thời gian ký không chính xác",
        "ECW039": "Hợp đồng đã được ký, bạn không thể ký lại",
        "ECW040": "Hợp đồng không cho phép ký",
        "ECW041": "Loại chữ ký số không hợp lệ",
        "ECW042": "Thao tác không chính xác, chỉ được phép ký hợp đồng có trạng thái chờ ký",
        "ECW043": "Thao tác không chính xác, chỉ được phép từ chối hợp đồng có trạng thái chờ ký",
        "ECW044": "Gói dịch vụ không tìm thấy",
        "ECW045": "Bạn chưa đủ điều kiện cấp chứng thư số, liên hệ lại cán bộ nhân sự để kiểm tra lại hồ sơ đề nghị cấp chứng thư",
        "ECW046": "Người lao động đã bị ngừng hoạt động",
        "ECW047": "Người lao động đã được cấp chứng thư",
        "ECW048": "Gói dịch vụ đã hết hạn, vui lòng liên hệ với nhà cung cấp để được gia hạn",
        "ECW049": "Số lần cấp chứng thư số trong gói hiện tại đã hết. vui lòng liên hệ nhà cung cấp để gia hạn gói",
        "ECW050": "Tài khoản chứng thư số không chính xác",
        "ECW051": "Loại hợp đồng không được hỗ trợ",
        "ECW052": "Hợp đồng đã tồn tại trên eContract",
        "ECW053": "Không tìm thấy loại chữ ký số",
        "ECW054": "Tài khoản ký số chưa được cập nhật",
        "ECW055": "Mật khẩu ký số mặc định chưa được đổi",
        "ECW056": "Không thể tạo tài khoản tra cứu do đã tồn tại tài khoản cùng tên đăng nhập",
        "ECW057": "Bạn không thể thực hiện chức năng này do chưa cấu hình xác thực tra cứu hợp đồng bằng tài khoản của NLĐ",
        "ECW058": "Tài khoản tra cứu đã tồn tại",
        "ECW059": "Tài khoản tra cứu không tồn tại",
        "ECW060": "Thông tin hợp đồng không thuộc tài khoản đăng nhập của bạn. Vui lòng kiểm tra lại",
        "ECW061": "Chưa đăng ký gói SMS",
        "ECW062": "Gói SMS đã sử dụng hết. Vui lòng gia hạn gói để tiếp tục sử dụng dịch vụ",
        "ECW063": "Bạn cần tích đồng ý để tiếp tục",
        "ECW064": "Không sinh được mã rút gọn",
        "ECW065": "Không lấy được ảnh chữ ký số",
        "ECW066": "Hợp đồng đã bị hủy",
        "ECW067": "Mật khẩu EFY-ID cũ không chính xác",
        "ECW070" : "Vui lòng nhập mật khẩu mới khác với mật khẩu cũ",



        "_comment": "phía dưới là code của remote",
        "0": "Thành Công",
        "1000": "Địa chỉ Ip không hợp lệ",
        "1001": "Dữ liệu tín dụng không hợp lệ",
        "1002": "Dữ liệu đẩy lên không hợp lệ",
        "1003": "Ngoại lệ bất ngờ",
        "1004": "Mã xác thực không chính xác",
        "1005": "Tài khoản đã bị khóa",
        "1006": "Mã xác thức hết thời hạn",
        "1007": "Yêu cầu được chấp thuận",
        "1008": "Không tìm thấy tài khoản ký số",
        "1009": "chứng nhận không được đăng ký",
        "1010": "Tài khoản ký số đã tồn tại",
        "1011": "Tính toán không được hỗ trợ",
        "1012": "Truy cập bị từ chối",
        "1013": "Tài khoản ký số chưa sẵn sàng",
        "1014": "Chứng thư số đã hết hạn",
        "1015": "Mã hóa đơn đã hết hạn dẫn tới ngoại lệ khi đăng ký",
        "1016": "Tệp tin đang xử lý",
        "1017": "Tài khoản ký số đã bị thu hồi",
        "1018": "Thành công. Mật khẩu ký số đã được thay đổi",
        "1019": "Truy cập chức năng bị từ chối",
        "1020": "Không thể kiểm tra lại",
        "1021": "Chứng thư số đã bị thu hồi",
        "1022": "Chứng thư số không tồn tại",
        "1023": "Không tìm thấy tài khoản ký số đã chia sẻ",
        "1024": "Tài khoản chia sẻ không hợp lệ với chế độ chia sẻ",
        "1025": "Không tìm thấy file",
        "1026": "Nhiều người sử dụng trùng tài khoản ký số",
        "1027": "Phiên giao dịch chưa kết thúc",
        "1029": "Tín dụng đã hết hạn",
        "1028": "Email đã tồn tại",
        "1036": "Lỗi cấp giấy chứng nhận",
        "ECE999": "Lỗi không xác định"
    }
}
